update Readme; use plantuml
