--- a/README.md
+++ b/README.md
@@ -82,65 +94,55 @@
 
 #### UML
 
-```mermaid
----
-title: Null Object Pattern
----
-classDiagram
-    class Operation {
-        <<abstract>>
+```plantuml
+hide circle
+skinparam classAttributeIconSize 0
+skinparam linetype ortho
+
+title Null Object Pattern
+
+    class Operation <<abstract>> {
         + execute() void
     }
 
-    class RealOperation {
-        <<implementation>>
+    class RealOperation <<implementation>> {
         + execute() void
     }
-    RealOperation --|> Operation : is a
-    note for RealOperation "execute() {
-        someOperation()
-    }"
+    Operation <|-- RealOperation
+    note bottom
+        execute() {
+            doSomething()
+        }
+    endnote
 
-    class NullOperation {
-        <<implementation>>
+    class NullOperation <<implementation>> {
         + execute() void
     }
-    NullOperation --|> Operation : is a
-    note for NullOperation "execute() {
-        // do nothing
-    }"
+    Operation <|-- NullOperation
+
+    note bottom
+        execute() {
+            doSomething()
+        }
+    endnote
 ```
